---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotchThicknessIsLargerThanLandingWarning
source: html/99ca0001-804e-2513-3b29-773684d9d32b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotchThicknessIsLargerThanLandingWarning Property

The notch thickness is larger than landing.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotchThicknessIsLargerThanLandingWarning { get; }
```